---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.Dispose
source: html/204149be-eb02-e742-9a6f-5f795cb90afe.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.Dispose Method

Releases all resources used by the ExternalResourceBrowserData

## Syntax (C#)
```csharp
public void Dispose()
```